tangyangguang/Esp32_Faucet/src/app/AppController.cpp
void AppController::handleLocalRecordCalibrationEvent(ButtonEvent event, std::uint32_t nowSeconds) {
    switch (event.type) {
        case ButtonEventType::CancelDown:
        case ButtonEventType::CancelShort:
        case ButtonEventType::CancelLong:
            localMode_ = LocalUiMode::Result;
            localCalibrationIgnoreOkUntilRelease_ = false;
            localCalibrationOkReleaseSeen_ = false;
            pendingBeep_ = BeepPattern::Click;
            break;
        case ButtonEventType::PlusShort:
        case ButtonEventType::PlusLong: {
            const std::uint32_t next =
                localCalibrationActualMl_ > kMaxVolumePresetMl - localCalibrationStepMl_
                    ? kMaxVolumePresetMl
                    : localCalibrationActualMl_ + localCalibrationStepMl_;
            if (next != localCalibrationActualMl_) {
                localCalibrationActualMl_ = next;
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        }
        case ButtonEventType::MinusShort:
        case ButtonEventType::MinusLong: {
            const std::uint32_t next =
                localCalibrationActualMl_ <= kCalibrationMinActualMl + localCalibrationStepMl_
                    ? kCalibrationMinActualMl
                    : localCalibrationActualMl_ - localCalibrationStepMl_;
            if (next != localCalibrationActualMl_) {
                localCalibrationActualMl_ = next;
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        }
        case ButtonEventType::OkShort: {
            if (localCalibrationIgnoreOkUntilRelease_) {
                localCalibrationIgnoreOkUntilRelease_ = false;
                localCalibrationOkReleaseSeen_ = false;
                break;
            }
            const CalibrationApplyResult result =
                lastResultRecordValid_
                    ? applyCalibrationFromRecordInternal(lastResultRecord_, localCalibrationActualMl_, true, nowSeconds)
                    : CalibrationApplyResult::InvalidRecord;
            if (result != CalibrationApplyResult::Saved) {
                pendingBeep_ = BeepPattern::Error;
            }
            break;
        }
        case ButtonEventType::OkLong:
            if (localCalibrationIgnoreOkUntilRelease_) {
                localCalibrationIgnoreOkUntilRelease_ = false;
                localCalibrationOkReleaseSeen_ = false;
                break;
            }
            break;
        case ButtonEventType::None:
        default:
            break;
    }
}

void AppController::restoreCalibrationSession() {
    calibrationSession_ = CalibrationSessionRecord{};
    if (!calibrationSessions_ || !calibrationSessions_->ready()) {
        return;
    }
    if (!calibrationSessions_->load(calibrationSession_)) {
        return;
    }
    if (calibrationSession_.status == CalibrationSessionStatus::Running) {
        if (calibrationSession_.attemptCount > 0) {
            CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
            attempt.status = CalibrationAttemptStatus::Invalid;
            attempt.invalidReason = CalibrationInvalidReason::ErrorResult;
            if (calibrationSessionTraces_ && attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
                calibrationSessionTraces_->invalidate(attempt.sessionTraceSlot);
            }
        }
        calibrationSession_.status = CalibrationSessionStatus::WaitingLocalRun;
        saveCalibrationSession();
    }
    invalidateAwaitingActualIfRamTraceMissing(0);
    if ((calibrationSession_.status == CalibrationSessionStatus::Discarded ||
         calibrationSession_.status == CalibrationSessionStatus::WaitingLocalRun ||
         calibrationSession_.status == CalibrationSessionStatus::ReadyToGenerate ||
         calibrationSession_.status == CalibrationSessionStatus::Generated) &&
        calibrationCanQuickGenerate(calibrationSession_)) {
        const BeepPattern restoredBeep = pendingBeep_;
        refreshCalibrationCandidate(calibrationSession_.updatedAt);
        pendingBeep_ = restoredBeep;
    }
    if (calibrationSession_.status == CalibrationSessionStatus::Preparing ||
        calibrationSession_.status == CalibrationSessionStatus::WaitingLocalRun ||
        calibrationSession_.status == CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.status == CalibrationSessionStatus::ReadyToGenerate ||
        calibrationSession_.status == CalibrationSessionStatus::Generated) {
        localMode_ = LocalUiMode::Calibration;
    }
}

bool AppController::invalidateAwaitingActualIfRamTraceMissing(std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    if (attempt.status != CalibrationAttemptStatus::PendingActual) {
        return false;
    }
    const WaterPulseTrace* trace = pulseTraces_ ? pulseTraces_->findByRecord(attempt.record) : nullptr;
    if (trace && trace->bucketCount > 0) {
        return false;
    }
    attempt.status = CalibrationAttemptStatus::Invalid;
    attempt.invalidReason = CalibrationInvalidReason::MissingActualMl;
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    if (nowSeconds != 0) {
        calibrationSession_.updatedAt = nowSeconds;
    }
    saveCalibrationSession();
    return true;
}

bool AppController::saveCalibrationSession() {
    return calibrationSessions_ && calibrationSessions_->ready() && calibrationSessions_->save(calibrationSession_);
}

bool AppController::beginCalibrationLocalRun(std::uint32_t nowMs,
                                             std::uint32_t nowUs,
                                             std::uint32_t nowSeconds,
                                             bool timeSynced,
                                             std::uint32_t bootId) {
    if ((calibrationSession_.status != CalibrationSessionStatus::WaitingLocalRun &&
         calibrationSession_.status != CalibrationSessionStatus::ReadyToGenerate &&
         calibrationSession_.status != CalibrationSessionStatus::Generated) ||
        water_.snapshot().state != WaterState::Idle || !calibrationCanStartAttempt(calibrationSession_)) {
        return false;
    }
    if (!water_.startUntargeted(nowMs)) {
        return false;
    }
    clearCalibrationCandidate();
    calibrationSession_.status = CalibrationSessionStatus::Running;
    calibrationSession_.updatedAt = nowSeconds;
    saveCalibrationSession();
    activeStartTimeSec_ = nowSeconds;
    activeStartTimeSynced_ = timeSynced;
    activeStartBootId_ = timeSynced ? 0 : bootId;
    resetRunFlowState();
    if (pulseTraces_) {
        pulseTraces_->setRecentTraceLimit(kRecentPulseTraceCount);
        activeTraceId_ = pulseTraces_->beginTrace(nowSeconds, config_.pulseMinIntervalUs);
        activeTraceStartUs_ = nowUs;
    }
    pendingBeep_ = BeepPattern::Click;
    return true;
}

void AppController::resetRunFlowState() {
    flow_.reset();
    lastFlowVolumeMl_ = 0;
    currentFlowMlPerMin_ = 0;
    instantFlowMlPerMin_ = 0;
    windowFlowMlPerMin_ = 0;
    displayFlowMlPerMin_ = 0;
    runAverageFlowMlPerMin_ = 0;
    if (waterSensors_) {
        waterSensors_->beginRun();
    }
}

std::uint8_t AppController::selectCalibrationSessionTraceSlot() const {
    bool occupied[kCalibrationSessionTraceSlots]{};
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if ((attempt.status == CalibrationAttemptStatus::Valid ||
             attempt.status == CalibrationAttemptStatus::PendingActual) &&
            attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
            occupied[attempt.sessionTraceSlot] = true;
        }
    }
    for (std::uint8_t slot = 0; slot < kCalibrationSessionTraceSlots; ++slot) {
        if (!occupied[slot]) {
            return slot;
        }
    }
    return 255;
}

void AppController::persistCalibrationPendingAttempt(const WaterRecord& record, std::uint32_t nowSeconds) {
    if (localMode_ != LocalUiMode::Calibration ||
        calibrationSession_.status != CalibrationSessionStatus::Running ||
        !calibrationSessionTraces_ || !calibrationSessionTraces_->ready() ||
        calibrationSession_.attemptCount >= kCalibrationMaxAttempts) {
        return;
    }

    const std::uint8_t slot = selectCalibrationSessionTraceSlot();
    CalibrationAttempt attempt{};
    attempt.attemptIndex = calibrationSession_.attemptCount;
    attempt.sessionTraceSlot = slot;
    attempt.record = record;
    attempt.targetHintMl = record.targetValue;
    attempt.status = CalibrationAttemptStatus::PendingActual;

    if (slot >= kCalibrationSessionTraceSlots) {
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::StorageFailed;
        appendCalibrationAttempt(calibrationSession_, attempt);
        calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                    : CalibrationSessionStatus::Failed;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return;
    }

